In [23]:
import pandas as pd
import seaborn as sns

data = pd.read_json('gme.json')
data.head()

        Date     Open     High      Low    Close  Adj Close    Volume
0 2002-02-13  2.40625  2.51500  2.38125  2.51250   1.691666  76216000
1 2002-02-14  2.54375  2.54875  2.48125  2.50000   1.683250  11021600
2 2002-02-15  2.50000  2.50625  2.46250  2.48750   1.674834   8389600
3 2002-02-19  2.47500  2.47500  2.34375  2.38750   1.607504   7410400
4 2002-02-20  2.40000  2.46875  2.38125  2.46875   1.662210   6892800

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5600 entries, 0 to 5599
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       5600 non-null   datetime64[ns]
 1   Open       5600 non-null   float64
 2   High       5600 non-null   float64
 3   Low        5600 non-null   float64
 4   Close      5600 non-null   float64
 5   Adj Close  5600 non-null   float64
 6   Volume     5600 non-null   int64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 306.4 KB

In [25]:
data[data['High'] == data['High'].max()]

           Date   Open    High      Low      Close  Adj Close     Volume
4772 2021-01-28  66.25  120.75  28.0625  48.400002  48.400002  235263200

In [26]:
maxDate = data[data['Date'] == data['Date'].max()]
maxDate

           Date   Open       High    Low      Close  Adj Close     Volume
5599 2024-05-13  26.34  38.200001  24.77  30.450001  30.450001  182308700

In [27]:
minDate = data[data['Date'] == data['Date'].min()]
minDate

        Date     Open   High      Low   Close  Adj Close    Volume
0 2002-02-13  2.40625  2.515  2.38125  2.5125   1.691666  76216000

In [38]:
years = {}
for i in range(len(data)):
    year = data.loc[i]['Date'].year
    if year not in years.keys() and year != 2024:
        years[year] = 1
    elif year in years.keys() and year != 2024:
        years[year] += 1
sum(years.values())/len(years)

250.36363636363637